# Introdução Data Science - Ana Beatriz Macedo<img src="https://octocat-generator-assets.githubusercontent.com/my-octocat-1626096942740.png" width="324" height="324" align="right">
## Link para download: https://github.com/AnabeatrizMacedo241/DataScience-101
## Github: https://github.com/AnabeatrizMacedo241
## Linkedin: https://www.linkedin.com/in/ana-beatriz-oliveira-de-macedo-85b05b215/
![yellow-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

### Nessa oitava parte veremos como utilizar o `SQL` em um caderno Jupyter

In [6]:
import pandas as pd
import sqlite3

In [5]:
pip install ipython-sql

In [7]:
df = pd.DataFrame({'Times': ['Boston Celtics', 'Los Angeles Lakers', 'Golden State Warriors', 'Chicago Bulls',
                              'San Antonio Spurs', 'Philadelphia 76ers', 'Detroit Pistons', 'Miami Heat',
                              'New York Knicks', 'Houston Rockets'],
                    'Títulos': [17, 17, 6, 6, 5, 3, 3, 3, 2, 2],
                   'Finais': [21, 33, 11, 6, 6, 9, 7, 6, 8, 4],
                   })
df

                   Times  Títulos  Finais
0         Boston Celtics       17      21
1     Los Angeles Lakers       17      33
2  Golden State Warriors        6      11
3          Chicago Bulls        6       6
4      San Antonio Spurs        5       6
5     Philadelphia 76ers        3       9
6        Detroit Pistons        3       7
7             Miami Heat        3       6
8        New York Knicks        2       8
9        Houston Rockets        2       4

In [9]:
connection = sqlite3.connect('data_science101.db')

In [10]:
df.to_sql('nbaTeams', connection) #Parâmetros: (nome_tabela, variável da conexão)
%load_ext sql

%sql sqlite:///data_science101.db

`SELECT` é um comando para retornar informações de um banco de dados e `*` significa que irá retornar tudo.

In [12]:
%%sql
SELECT * FROM nbaTeams #Retorna nossa tabela em linguagem SQL

 * sqlite:///data_science101.db
Done.

[(0, 'Boston Celtics', 17, 21),
 (1, 'Los Angeles Lakers', 17, 33),
 (2, 'Golden State Warriors', 6, 11),
 (3, 'Chicago Bulls', 6, 6),
 (4, 'San Antonio Spurs', 5, 6),
 (5, 'Philadelphia 76ers', 3, 9),
 (6, 'Detroit Pistons', 3, 7),
 (7, 'Miami Heat', 3, 6),
 (8, 'New York Knicks', 2, 8),
 (9, 'Houston Rockets', 2, 4)]

`COUNT()` é usado para contar a quantidade de 'linhas'

In [13]:
%%sql
SELECT COUNT(*) FROM nbaTeams

 * sqlite:///data_science101.db
Done.

[(10,)]

Usamos o `WHERE` para retornar informações específicas. Neste caso, retorna apenas os time com mais de 10 títulos

In [22]:
%%sql
SELECT * FROM nbaTeams WHERE Títulos>10

 * sqlite:///data_science101.db
Done.

[(0, 'Boston Celtics', 17, 21), (1, 'Los Angeles Lakers', 17, 33)]

Com os comandos `BETWEEN` e `AND` retornamos informação dentro de um limite. Neste caso, todos os times que participaram entre 5 ou 10 finais

In [20]:
%%sql
SELECT * FROM nbaTeams WHERE Finais BETWEEN 5 AND 10

 * sqlite:///data_science101.db
Done.

[(3, 'Chicago Bulls', 6, 6),
 (4, 'San Antonio Spurs', 5, 6),
 (5, 'Philadelphia 76ers', 3, 9),
 (6, 'Detroit Pistons', 3, 7),
 (7, 'Miami Heat', 3, 6),
 (8, 'New York Knicks', 2, 8)]

`ORDER BY` retornará alguma coluna em certa ordem. `asc` é ascendente e `desc` seria descendente.

In [26]:
%%sql
select * from nbaTeams order by Finais asc

 * sqlite:///data_science101.db
Done.

[(9, 'Houston Rockets', 2, 4),
 (3, 'Chicago Bulls', 6, 6),
 (4, 'San Antonio Spurs', 5, 6),
 (7, 'Miami Heat', 3, 6),
 (6, 'Detroit Pistons', 3, 7),
 (8, 'New York Knicks', 2, 8),
 (5, 'Philadelphia 76ers', 3, 9),
 (2, 'Golden State Warriors', 6, 11),
 (0, 'Boston Celtics', 17, 21),
 (1, 'Los Angeles Lakers', 17, 33)]

In [27]:
%%sql
select * from nbaTeams order by Finais desc

 * sqlite:///data_science101.db
Done.

[(1, 'Los Angeles Lakers', 17, 33),
 (0, 'Boston Celtics', 17, 21),
 (2, 'Golden State Warriors', 6, 11),
 (5, 'Philadelphia 76ers', 3, 9),
 (8, 'New York Knicks', 2, 8),
 (6, 'Detroit Pistons', 3, 7),
 (3, 'Chicago Bulls', 6, 6),
 (4, 'San Antonio Spurs', 5, 6),
 (7, 'Miami Heat', 3, 6),
 (9, 'Houston Rockets', 2, 4)]

Assim como no pandas, SQL também possui alguns métodos de estatística. 
- `min()`retornará o menor número de uma certa coluna
- `max()` retornará o maior número de uma certa coluna
- `avg()` retornara a média dessa coluna
- `sum()` retornará a soma de todos os elementos dessa coluna

In [28]:
%%sql
select min(Títulos), max(Títulos), avg(Títulos), count(*), sum(Títulos) from nbaTeams

 * sqlite:///data_science101.db
Done.

[(2, 17, 6.4, 10, 64)]

Se quisermos inserer novas informações podemos usar o comando `INSERT INTO` colocando o nome das colunas e seus valores(`values`) em seguida.

In [33]:
%%sql
insert into nbaTeams(Times, Títulos, Finais) values("Toronto Raptors", 1, 1)

 * sqlite:///data_science101.db
1 rows affected.

[]

In [34]:
%%sql
SELECT * FROM nbaTeams

 * sqlite:///data_science101.db
Done.

[(0, 'Boston Celtics', 17, 21),
 (1, 'Los Angeles Lakers', 17, 33),
 (2, 'Golden State Warriors', 6, 11),
 (3, 'Chicago Bulls', 6, 6),
 (4, 'San Antonio Spurs', 5, 6),
 (5, 'Philadelphia 76ers', 3, 9),
 (6, 'Detroit Pistons', 3, 7),
 (7, 'Miami Heat', 3, 6),
 (8, 'New York Knicks', 2, 8),
 (9, 'Houston Rockets', 2, 4),
 (None, 'Toronto Raptors', 1, 1)]

### Até a próxima aula e bons estudos!
## Ana Beatriz Macedo
![blue-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)